Documents/ВыделениеНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВыделениеНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияРеквизитов</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>InformationRegister.ЦеныТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаВключенногоНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыделениеНДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Шапка
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	Если Вопрос("Хотите установить новую ставку для всех товаров?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Для Каждого Строка Из Объект.Товары Цикл
			Строка.СтавкаВключенногоНДС = Объект.СтавкаНДС;
			ТоварыПересчитатьСтроку(Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Товары
&НаСервере
Процедура ТоварыЗаполнитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Товар КАК Товар,
	|	Склад КАК Склад,
	|	СУММА(КоличествоОстаток) КАК Количество,
	|	СУММА(СуммаОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Дата, Порожняя = Ложь И Бронь = Ложь)
	|ГДЕ 
	|	Товар.ВидТовара.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТовара.Продукция) ИЛИ Товар.ВидТовара.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТовара.Товар)
	|СГРУППИРОВАТЬ ПО
	|	Товар,
	|	Склад
	|УПОРЯДОЧИТЬ ПО
	|	Товар.Наименование,
	|	Склад.Наименование
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	Товар,
	|	Склад");
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТовар.Следующий() Цикл
		ВыборкаСклад = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			СтарыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Товар,Склад", ВыборкаСклад.Товар, ВыборкаСклад.Склад));
			Если СтарыеСтроки.Количество() > 0 Тогда
				ТекСтрока = СтарыеСтроки[0];
			Иначе
				ТекСтрока = Объект.Товары.Добавить();
			КонецЕсли;
			
			ТекСтрока.Товар = ВыборкаСклад.Товар;
			ТекСтрока.Склад = ВыборкаСклад.Склад;
			ТекСтрока.Количество = ВыборкаСклад.Количество;
			ТекСтрока.СуммаПродажная = ВыборкаСклад.Сумма;
			ТекСтрока.ЦенаБазоваяСНДС = ТекСтрока.СуммаПродажная / ТекСтрока.Количество;
			ТекСтрока.СтавкаВключенногоНДС = ?(ТекСтрока.Товар.СтавкаНДС.Ставка > 0, ТекСтрока.Товар.СтавкаНДС, Объект.СтавкаНДС);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаполнить(Кнопка)
	ТоварыЗаполнитьНаСервере();
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТоварыПересчитатьСтроку(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.Количество = РаботаСтоварами.Остаток(Строка.Склад, Строка.Товар, Объект.Дата);
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаБазоваяСНДСПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаВключенногоНДСПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПродажнаяПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.ЦенаБазоваяСНДС = Строка.СуммаПродажная / Строка.Количество;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСтроку(Строка)
	Строка.СуммаПродажная = Строка.Количество * Строка.ЦенаБазоваяСНДС;
	Строка.СуммаБезНДС = Строка.СуммаПродажная / ((100 + Строка.СтавкаВключенногоНДС) / 100);
	Строка.СуммаНДС = Строка.СуммаПродажная - Строка.СуммаБезНДС;
	Строка.ЦенаБазоваяБезНДС = АрифметическиеФункции.ВычитатьНаценку(Строка.ЦенаБазоваяСНДС, Строка.СтавкаВключенногоНДС);
КонецПроцедуры

// Вспомагательные
&НаКлиенте
Процедура ОбновитьИтоги()
	Количество = Объект.Товары.Итог("Количество");
	СуммаБезНДС = Объект.Товары.Итог("СуммаБезНДС");
	СуммаНДС = Объект.Товары.Итог("СуммаНДС");
	СуммаПродажная = Объект.Товары.Итог("СуммаПродажная");
КонецПроцедуры
